package com.covas.admon.android.util;

import java.util.ArrayList;
import java.util.LinkedHashMap;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

public class CityInfo {
	
	private static LinkedHashMap<String, ArrayList<String>> cityArr;
	
	private static ArrayList<String> citys;

	public static final String DEFAULT_CITY = "北京";
	public static final String DEFAULT_TOWN = "通州";
	
	public static LinkedHashMap<String, ArrayList<String>> getInfo(){
		
		if(cityArr != null) return cityArr;
		
		cityArr = new LinkedHashMap<String, ArrayList<String>>();
		
		citys = new ArrayList<String>();
		
		try {
			JSONArray jArr = new JSONArray(cityInfoJsonString());
			
			int cMax = jArr.length();
			
			for(int i=0; i<cMax; i++){
				JSONObject cityJson = (JSONObject) jArr.get(i);
				
				String cityName = cityJson.getString("city");
				JSONArray townJArr = new JSONArray( cityJson.getString("town") );
				
				 ArrayList<String> towns = new  ArrayList<String>();
				
				int tMax = townJArr.length();
				
				for(int j=0; j<tMax; j++){
					towns.add(townJArr.getString(j));
				}
				
				citys.add(cityName);
				cityArr.put(cityName, towns);
			}
			
		} catch (JSONException e) {
			e.printStackTrace();
		}
		
		return cityArr;
	}
	
	public static ArrayList<String> getCityArr(){
		
		if(citys == null) getInfo();
		
		return citys;
	}
	
	public static ArrayList<String> getTownArr(String city){
		
		if(cityArr == null) getInfo();
		/*Iterator<String> iter = cityArr.get(city).keySet().iterator();
        
		ArrayList<String> townArr = new ArrayList<String>();
		
        while(iter.hasNext()){
        	String town = iter.next();
        	townArr.add(town);
        }*/
		
		return cityArr.get(city);
	}
	
	
	private static String cityInfoJsonString(){
		
		//String json = "[{\"city\":\"강원\",\"town\":[\"평창군\",\"고성군\",\"홍천군\",\"철원군\",\"강릉시\",\"태백시\",\"인제군\",\"원주시\",\"화천군\",\"동해시\",\"정선군\",\"영월군\",\"삼척시\",\"양구군\",\"춘천시\",\"양양군\",\"속초시\",\"횡성군\"]},{\"city\":\"경기\",\"town\":[\"고양시일산서구\",\"안산시단원구\",\"평택시\",\"과천시\",\"수원시영통구\",\"가평군\",\"고양시덕양구\",\"부천시오정구\",\"안양시동안구\",\"수원시팔달구\",\"광명시\",\"연천군\",\"광주시\",\"용인시처인구\",\"의정부시\",\"의왕시\",\"남양주시\",\"성남시분당구\",\"부천시원미구\",\"구리시\",\"이천시\",\"양평군\",\"여주군\",\"용인시수지구\",\"오산시\",\"파주시\",\"포천시\",\"양주시\",\"고양시일산동구\",\"안산시상록구\",\"안성시\",\"화성시\",\"안양시만안구\",\"용인시기흥구\",\"군포시\",\"동두천시\",\"김포시\",\"성남시수정구\",\"수원시장안구\",\"성남시중원구\",\"하남시\",\"수원시권선구\",\"시흥시\",\"부천시소사구\"]},{\"city\":\"경남\",\"town\":[\"진주시\",\"의령군\",\"양산시\",\"밀양시\",\"거창군\",\"고성군\",\"합천군\",\"함양군\",\"함안군\",\"통영시\",\"창원시마산회원구\",\"창녕군\",\"김해시\",\"거제시\",\"남해군\",\"산청군\",\"창원시마산합포구\",\"사천시\",\"하동군\",\"창원시의창구\",\"창원시성산구\",\"창원시진해구\"]},{\"city\":\"경북\",\"town\":[\"영천시\",\"봉화군\",\"성주군\",\"예천군\",\"문경시\",\"영양군\",\"청송군\",\"영주시\",\"울릉군\",\"군위군\",\"울진군\",\"경산시\",\"포항시북구\",\"경주시\",\"포항시남구\",\"영덕군\",\"상주시\",\"김천시\",\"구미시\",\"칠곡군\",\"안동시\",\"고령군\",\"의성군\",\"청도군\"]},{\"city\":\"광주\",\"town\":[\"남구\",\"서구\",\"광산구\",\"동구\",\"북구\"]},{\"city\":\"대구\",\"town\":[\"달서구\",\"북구\",\"수성구\",\"동구\",\"중구\",\"남구\",\"달성군\",\"서구\"]},{\"city\":\"대전\",\"town\":[\"중구\",\"서구\",\"대덕구\",\"유성구\",\"동구\"]},{\"city\":\"부산\",\"town\":[\"동구\",\"수영구\",\"사상구\",\"해운대구\",\"부산진구\",\"북구\",\"동래구\",\"사하구\",\"강서구\",\"서구\",\"연제구\",\"금정구\",\"기장군\",\"남구\",\"중구\",\"영도구\"]},{\"city\":\"서울\",\"town\":[\"송파구\",\"서대문구\",\"종로구\",\"강동구\",\"강남구\",\"도봉구\",\"동대문구\",\"영등포구\",\"성동구\",\"용산구\",\"마포구\",\"노원구\",\"중구\",\"관악구\",\"은평구\",\"구로구\",\"강서구\",\"중랑구\",\"광진구\",\"서초구\",\"양천구\",\"동작구\",\"강북구\",\"금천구\",\"성북구\"]},{\"city\":\"울산\",\"town\":[\"중구\",\"남구\",\"울주군\",\"북구\",\"동구\"]},{\"city\":\"인천\",\"town\":[\"계양구\",\"동구\",\"남동구\",\"부평구\",\"남구\",\"옹진군\",\"연수구\",\"서구\",\"중구\",\"강화군\"]},{\"city\":\"전남\",\"town\":[\"영암군\",\"강진군\",\"순천시\",\"나주시\",\"완도군\",\"고흥군\",\"함평군\",\"광양시\",\"보성군\",\"신안군\",\"화순군\",\"목포시\",\"담양군\",\"무안군\",\"영광군\",\"해남군\",\"장흥군\",\"구례군\",\"장성군\",\"진도군\",\"곡성군\",\"여수시\"]},{\"city\":\"전북\",\"town\":[\"완주군\",\"임실군\",\"김제시\",\"군산시\",\"익산시\",\"진안군\",\"장수군\",\"전주시완산구\",\"남원시\",\"정읍시\",\"무주군\",\"부안군\",\"고창군\",\"전주시덕진구\",\"순창군\"]},{\"city\":\"제주\",\"town\":[\"제주시\",\"서귀포시\"]},{\"city\":\"충남\",\"town\":[\"예산군\",\"천안시동남구\",\"천안시서북구\",\"보령시\",\"홍성군\",\"계룡시\",\"금산군\",\"아산시\",\"청양군\",\"공주시\",\"연기군\",\"부여군\",\"당진군\",\"서천군\",\"서산시\",\"논산시\",\"태안군\"]},{\"city\":\"충북\",\"town\":[\"청주시상당구\",\"제천시\",\"충주시\",\"청주시흥덕구\",\"괴산군\",\"청원군\",\"음성군\",\"옥천군\",\"영동군\",\"단양군\",\"진천군\",\"증평군\",\"보은군\"]}]";
		String json = "[{\"city\":\"北京\",\"town\":[\"通州\",\"房山\",\"昌平\",\"顺义\",\"怀柔\",\"大兴\",\"密云\",\"平谷\",\"延庆\",\"东城\",\"崇文\",\"西城\",\"朝阳\",\"宣武\",\"石景山\",\"丰台\",\"门头沟\",\"海淀\"]},{\"city\":\"上海\",\"town\":[\"普陀\",\"闸北\",\"虹口\",\"杨浦\",\"卢湾\",\"徐汇\",\"长宁\",\"静安\",\"黄浦\",\"金山\",\"浦东新\",\"嘉定\",\"闵行\",\"宝山\",\"南汇\",\"青浦\",\"松江\",\"奉贤\",\"崇明\"]},{\"city\":\"天津\",\"town\":[\"武清\",\"河东\",\"和平\",\"西青\",\"津南\",\"大港\",\"东丽\",\"塘沽\",\"汉沽\",\"河北\",\"红桥\",\"河西\",\"南开\",\"蓟县\",\"宁河\",\"静海\",\"宝坻\",\"北辰\"]},{\"city\":\"重庆\",\"town\":[\"开县\",\"江北\",\"沙坪坝\",\"九龙坡\",\"南岸\",\"北碚\",\"万盛\",\"双桥\",\"渝北\",\"巴南\",\"黔江\",\"垫江\",\"武隆\",\"巫山\",\"巫溪\",\"云阳\",\"奉节\",\"忠县\",\"梁平\",\"璧山\",\"荣昌\",\"大足\",\"铜梁\",\"潼南\",\"綦江\",\"长寿\",\"彭水\",\"酉阳\",\"合川\",\"江津\",\"南川\",\"永川\",\"丰都\",\"城口\",\"大渡口\",\"渝中\",\"涪陵\",\"万州\",\"石柱\",\"秀山\"]},{\"city\":\"浙江\",\"town\":[\"丽水\",\"舟山\",\"宁波\",\"衢州\",\"温州\",\"杭州\",\"台州\",\"嘉兴\",\"绍兴\",\"金华\",\"湖州\"]},{\"city\":\"广东\",\"town\":[\"珠海\",\"惠州\",\"清远\",\"韶关\",\"江门\",\"揭阳\",\"云浮\",\"佛山\",\"广州\",\"深圳\",\"河源\",\"汕头\",\"汕尾\",\"茂名\",\"肇庆\",\"东莞\",\"湛江\",\"潮州\",\"阳江\",\"中山\",\"梅州\"]},{\"city\":\"江苏\",\"town\":[\"连云港\",\"盐城\",\"无锡\",\"宿迁\",\"扬州\",\"镇江\",\"南京\",\"徐州\",\"泰州\",\"南通\",\"常州\",\"淮安\",\"苏州\"]},{\"city\":\"山东\",\"town\":[\"淄博\",\"烟台\",\"日照\",\"荷泽\",\"潍坊\",\"济南\",\"济宁\",\"青岛\",\"临沂\",\"威海\",\"莱芜\",\"泰安\",\"东营\",\"聊城\",\"枣庄\",\"滨州\",\"德州\"]},{\"city\":\"福建\",\"town\":[\"南平\",\"厦门\",\"福州\",\"宁德\",\"龙岩\",\"莆田\",\"漳州\",\"泉州\",\"三明\"]},{\"city\":\"安徽\",\"town\":[\"淮南\",\"黄山\",\"蚌埠\",\"合肥\",\"宿州\",\"六安\",\"池州\",\"芜湖\",\"宣城\",\"巢湖\",\"亳州\",\"阜阳\",\"铜陵\",\"淮北\",\"滁州\",\"马鞍山\",\"安庆\"]},{\"city\":\"四川\",\"town\":[\"宜宾\",\"巴中\",\"南充\",\"成都\",\"凉山彝族\",\"眉山\",\"阿坝\",\"乐山\",\"绵阳\",\"广安\",\"广元\",\"德阳\",\"资阳\",\"达州\",\"泸州\",\"自贡\",\"遂宁\",\"甘孜藏族\",\"雅安\",\"内江\",\"攀枝花\"]},{\"city\":\"湖北\",\"town\":[\"咸宁\",\"宜昌\",\"黄冈\",\"荆州\",\"孝感\",\"荆门\",\"十堰\",\"鄂州\",\"天门\",\"潜江\",\"恩施\",\"武汉\",\"仙桃\",\"神农架林\",\"随州\",\"黄石\",\"襄樊\"]},{\"city\":\"河北\",\"town\":[\"张家口\",\"邯郸\",\"邢台\",\"衡水\",\"秦皇岛\",\"廊坊\",\"保定\",\"承德\",\"唐山\",\"沧州\",\"石家庄\"]},{\"city\":\"云南\",\"town\":[\"德宏\",\"玉溪\",\"曲靖\",\"保山\",\"怒江\",\"迪庆\",\"昭通\",\"昆明\",\"楚雄\",\"文山\",\"西双版纳\",\"丽江\",\"红河\",\"大理\",\"临沧\",\"思茅\"]},{\"city\":\"黑龙江\",\"town\":[\"鹤岗\",\"大兴安岭地\",\"大庆\",\"七台河\",\"齐齐哈尔\",\"牡丹江\",\"黑河\",\"双鸭山\",\"绥化\",\"伊春\",\"佳木斯\",\"哈尔滨\",\"鸡西\"]},{\"city\":\"吉林\",\"town\":[\"松原\",\"四平\",\"白城\",\"白山\",\"吉林\",\"通化\",\"长春\",\"延边朝鲜族\",\"辽源\"]},{\"city\":\"辽宁\",\"town\":[\"铁岭\",\"葫芦岛\",\"营口\",\"本溪\",\"辽阳\",\"盘锦\",\"阜新\",\"朝阳\",\"锦州\",\"抚顺\",\"丹东\",\"沈阳\",\"鞍山\",\"大连\"]},{\"city\":\"海南\",\"town\":[\"保亭\",\"澄迈\",\"南沙群岛\",\"陵水黎族\",\"中沙群岛\",\"屯昌\",\"昌江黎族\",\"乐东黎族\",\"琼海\",\"儋州\",\"文昌\",\"万宁\",\"白沙黎族\",\"海口\",\"三亚\",\"五指山\",\"琼中\",\"东方\",\"定安\",\"西沙群岛\",\"临高\"]},{\"city\":\"湖南\",\"town\":[\"郴州\",\"岳阳\",\"怀化\",\"娄底\",\"张家界\",\"益阳\",\"湘西土家族苗族\",\"常德\",\"湘潭\",\"永州\",\"衡阳\",\"株洲\",\"长沙\",\"邵阳\"]},{\"city\":\"河南\",\"town\":[\"南阳\",\"洛阳\",\"三门峡\",\"商丘\",\"焦作\",\"开封\",\"驻马店\",\"濮阳\",\"许昌\",\"安阳\",\"信阳\",\"漯河\",\"平顶山\",\"郑州\",\"新乡\",\"鹤壁\",\"周口\"]},{\"city\":\"贵州\",\"town\":[\"毕节地\",\"黔南\",\"六盘水\",\"黔东南\",\"贵阳\",\"遵义\",\"铜仁地\",\"黔西南\",\"安顺\"]},{\"city\":\"江西\",\"town\":[\"南昌\",\"萍乡\",\"景德镇\",\"吉安\",\"九江\",\"新余\",\"鹰潭\",\"抚州\",\"赣州\",\"上饶\",\"宜春\"]},{\"city\":\"广西\",\"town\":[\"贺州\",\"梧州\",\"河池\",\"百色\",\"来宾\",\"贵港\",\"玉林\",\"钦州\",\"北海\",\"柳州\",\"桂林\",\"南宁\",\"防城港\",\"崇左\"]},{\"city\":\"陕西\",\"town\":[\"咸阳\",\"铜川\",\"商洛\",\"榆林\",\"渭南\",\"汉中\",\"安康\",\"延安\",\"宝鸡\",\"西安\"]},{\"city\":\"山西\",\"town\":[\"临汾\",\"晋中\",\"朔州\",\"运城\",\"晋城\",\"阳泉\",\"忻州\",\"大同\",\"长治\",\"太原\",\"吕梁\"]},{\"city\":\"青海\",\"town\":[\"黄南\",\"海东地\",\"果洛\",\"西宁\",\"海北\",\"玉树\",\"海南\",\"海西\"]},{\"city\":\"宁夏\",\"town\":[\"石嘴山\",\"固原\",\"中卫\",\"银川\",\"吴忠\"]},{\"city\":\"甘肃\",\"town\":[\"兰州\",\"金昌\",\"甘南藏族\",\"平凉\",\"嘉峪关\",\"天水\",\"白银\",\"武威\",\"张掖\",\"庆阳\",\"定西\",\"临夏回族\",\"酒泉\",\"陇南\"]},{\"city\":\"西藏\",\"town\":[\"阿里地\",\"拉萨\",\"山南地\",\"日喀则地\",\"那曲地\",\"昌都地\",\"林芝地\"]},{\"city\":\"内蒙古\",\"town\":[\"巴彦淖尔\",\"锡林郭勒盟\",\"兴安盟\",\"乌兰察布\",\"鄂尔多斯\",\"乌海\",\"包头\",\"呼和浩特\",\"呼伦贝尔\",\"通辽\",\"阿拉善盟\",\"赤峰\"]},{\"city\":\"新疆\",\"town\":[\"伊犁\",\"克拉玛依\",\"哈密地\",\"石河子\",\"吐鲁番地\",\"阿拉尔\",\"阿勒泰地\",\"乌鲁木齐\",\"塔城地\",\"昌吉\",\"克孜勒\",\"图木舒克\",\"阿克苏地\",\"五家渠\",\"巴音郭楞\",\"和田地\",\"博尔塔拉\",\"喀什地\"]},{\"city\":\"台湾\",\"town\":[\"新竹\",\"基隆\",\"高雄\",\"台北\",\"台南\",\"嘉义\",\"台中\",\"宜兰\",\"屏东\",\"桃园\",\"台东\",\"苗栗\",\"金门\",\"花莲\",\"云林\",\"连江\",\"澎湖\",\"南投\",\"彰化\"]},{\"city\":\"香港\",\"town\":[\"油尖旺\",\"黄大仙\",\"深水埗\",\"观塘\",\"九龙城\",\"湾仔\",\"葵青\",\"离岛\",\"中西\",\"南\",\"东\",\"荃湾\",\"元朗\",\"沙田\",\"西贡\",\"屯门\",\"大埔\",\"北\"]},{\"city\":\"澳门\",\"town\":[\"花地玛堂\",\"圣安多尼堂\",\"大堂\",\"望德堂\",\"风顺堂\",\"嘉模堂\",\"圣方济各堂\"]},{\"city\":\"国外\",\"town\":[\"德国\",\"新加坡\",\"美国\",\"加拿大\",\"澳大利亚\",\"日本\",\"英国\",\"巴西\",\"俄罗斯\",\"尼日利亚\",\"马来西亚\",\"爱尔兰\",\"奥地利\",\"挪威\",\"意大利\",\"西班牙\",\"泰国\",\"芬兰\",\"丹麦\",\"荷兰\",\"阿联酋\",\"瑞典\",\"瑞士\",\"比利时\",\"新西兰\",\"法国\",\"韩国\",\"匈牙利\",\"其他\",\"越南\",\"以色列\",\"科威特\",\"希腊\",\"南非\",\"葡萄牙\",\"墨西哥\",\"印尼\"]}]";
		return json;
	}
}





/*


[
{\"city\":\"강원\",\"town\":[
\"평창군\",
\"고성군\",
\"홍천군\",
\"철원군\",
\"강릉시\",
\"태백시\",
\"인제군\",
\"원주시\",
\"화천군\",
\"동해시\",
\"정선군\",
\"영월군\",
\"삼척시\",
\"양구군\",
\"춘천시\",
\"양양군\",
\"속초시\",
\"횡성군\"
]},
{\"city\":\"경기\",\"town\":[
\"고양시 일산서구\",
\"안산시 단원구\",
\"평택시\",
\"과천시\",
\"수원시 영통구\",
\"가평군\",
\"고양시 덕양구\",
\"부천시 오정구\",
\"안양시 동안구\",
\"수원시 팔달구\",
\"광명시\",
\"연천군\",
\"광주시\",
\"용인시 처인구\",
\"의정부시\",
\"의왕시\",
\"남양주시\",
\"성남시 분당구\",
\"부천시 원미구\",
\"구리시\",
\"이천시\",
\"양평군\",
\"여주군\",
\"용인시 수지구\",
\"오산시\",
\"파주시\",
\"포천시\",
\"양주시\",
\"고양시 일산동구\",
\"안산시 상록구\",
\"안성시\",
\"화성시\",
\"안양시 만안구\",
\"용인시 기흥구\",
\"군포시\",
\"동두천시\",
\"김포시\",
\"성남시 수정구\",
\"수원시 장안구\",
\"성남시 중원구\",
\"하남시\",
\"수원시 권선구\",
\"시흥시\",
\"부천시 소사구\"
]},
{\"city\":\"경남\",\"town\":[
\"진주시\",
\"의령군\",
\"양산시\",
\"밀양시\",
\"거창군\",
\"고성군\",
\"합천군\",
\"함양군\",
\"함안군\",
\"통영시\",
\"창원시 마산회원구\",
\"창녕군\",
\"김해시\",
\"거제시\",
\"남해군\",
\"산청군\",
\"창원시 마산합포구\",
\"사천시\",
\"하동군\",
\"창원시 의창구\",
\"창원시 성산구\",
\"창원시 진해구\"
]},
{\"city\":\"경북\",\"town\":[
\"영천시\",
\"봉화군\",
\"성주군\",
\"예천군\",
\"문경시\",
\"영양군\",
\"청송군\",
\"영주시\",
\"울릉군\",
\"군위군\",
\"울진군\",
\"경산시\",
\"포항시 북구\",
\"경주시\",
\"포항시 남구\",
\"영덕군\",
\"상주시\",
\"김천시\",
\"구미시\",
\"칠곡군\",
\"안동시\",
\"고령군\",
\"의성군\",
\"청도군\"
]},
{\"city\":\"광주\",\"town\":[
\"남구\",
\"서구\",
\"광산구\",
\"동구\",
\"북구\"
]},
{\"city\":\"대구\",\"town\":[
\"달서구\",
\"북구\",
\"수성구\",
\"동구\",
\"중구\",
\"남구\",
\"달성군\",
\"서구\"
]},
{\"city\":\"대전\",\"town\":[
\"중구\",
\"서구\",
\"대덕구\",
\"유성구\",
\"동구\"
]},
{\"city\":\"부산\",\"town\":[
\"동구\",
\"수영구\",
\"사상구\",
\"해운대구\",
\"부산진구\",
\"북구\",
\"동래구\",
\"사하구\",
\"강서구\",
\"서구\",
\"연제구\",
\"금정구\",
\"기장군\",
\"남구\",
\"중구\",
\"영도구\"
]},
{\"city\":\"서울\",\"town\":[
\"송파구\",
\"서대문구\",
\"종로구\",
\"강동구\",
\"강남구\",
\"도봉구\",
\"동대문구\",
\"영등포구\",
\"성동구\",
\"용산구\",
\"마포구\",
\"노원구\",
\"중구\",
\"관악구\",
\"은평구\",
\"구로구\",
\"강서구\",
\"중랑구\",
\"광진구\",
\"서초구\",
\"양천구\",
\"동작구\",
\"강북구\",
\"금천구\",
\"성북구\"
]},
{\"city\":\"울산\",\"town\":[
\"중구\",
\"남구\",
\"울주군\",
\"북구\",
\"동구\"
]},
{\"city\":\"인천\",\"town\":[
\"계양구\",
\"동구\",
\"남동구\",
\"부평구\",
\"남구\",
\"옹진군\",
\"연수구\",
\"서구\",
\"중구\",
\"강화군\"
]},
{\"city\":\"전남\",\"town\":[
\"영암군\",
\"강진군\",
\"순천시\",
\"나주시\",
\"완도군\",
\"고흥군\",
\"함평군\",
\"광양시\",
\"보성군\",
\"신안군\",
\"화순군\",
\"목포시\",
\"담양군\",
\"무안군\",
\"영광군\",
\"해남군\",
\"장흥군\",
\"구례군\",
\"장성군\",
\"진도군\",
\"곡성군\",
\"여수시\"
]},
{\"city\":\"전북\",\"town\":[
\"완주군\",
\"임실군\",
\"김제시\",
\"군산시\",
\"익산시\",
\"진안군\",
\"장수군\",
\"전주시 완산구\",
\"남원시\",
\"정읍시\",
\"무주군\",
\"부안군\",
\"고창군\",
\"전주시 덕진구\",
\"순창군\"
]},
{\"city\":\"제주\",\"town\":[
\"제주시\",
\"서귀포시\"
]},
{\"city\":\"충남\",\"town\":[
\"예산군\",
\"천안시 동남구\",
\"천안시 서북구\",
\"보령시\",
\"홍성군\",
\"계룡시\",
\"금산군\",
\"아산시\",
\"청양군\",
\"공주시\",
\"연기군\",
\"부여군\",
\"당진군\",
\"서천군\",
\"서산시\",
\"논산시\",
\"태안군\"
]},
{\"city\":\"충북\",\"town\":[
\"청주시 상당구\",
\"제천시\",
\"충주시\",
\"청주시 흥덕구\",
\"괴산군\",
\"청원군\",
\"음성군\",
\"옥천군\",
\"영동군\",
\"단양군\",
\"진천군\",
\"증평군\",
\"보은군\"
]}
]


*/